
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиСервисногоАккаунта(СервисныйАккаунт) Экспорт
	
	НастройкиСервисногоАккаунта = НовыйНастройкиСервисногоАккаунта();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Ссылка КАК СервисныйАккаунт,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Сервер КАК Сервер,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Регион КАК Регион,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.ЗащищенноеСоединение КАК ЗащищенноеСоединение,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.ТипАутентификации КАК ТипАутентификации,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Сервис КАК Сервис,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Использовать КАК Использовать,
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Представление КАК Представление
	|ИЗ
	|	Справочник.ох_СервисныеАккаунтыОбъектныхХранилищ КАК ох_СервисныеАккаунтыОбъектныхХранилищ
	|ГДЕ
	|	ох_СервисныеАккаунтыОбъектныхХранилищ.Ссылка = &Ссылка
	|	И НЕ ох_СервисныеАккаунтыОбъектныхХранилищ.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Ссылка", СервисныйАккаунт);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(НастройкиСервисногоАккаунта, Выборка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НастройкиСервисногоАккаунта.СервисныйАккаунт) Тогда
		
		Ключи = ох_ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			НастройкиСервисногоАккаунта.СервисныйАккаунт,
			"ИдентификаторКлюча, СекретныйКлюч");
		
		Если Ключи <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НастройкиСервисногоАккаунта, Ключи);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НастройкиСервисногоАккаунта;
	
КонецФункции

Функция НовыйНастройкиСервисногоАккаунта() Экспорт
	
	НастройкиСервисногоАккаунта = Новый Структура;
	НастройкиСервисногоАккаунта.Вставить(
		"СервисныйАккаунт", Справочники.ох_СервисныеАккаунтыОбъектныхХранилищ.ПустаяСсылка());
	НастройкиСервисногоАккаунта.Вставить("Сервер", "");
	НастройкиСервисногоАккаунта.Вставить("Регион", "");
	НастройкиСервисногоАккаунта.Вставить("ЗащищенноеСоединение", Истина);
	НастройкиСервисногоАккаунта.Вставить("ТипАутентификации", "");
	НастройкиСервисногоАккаунта.Вставить("Сервис", "");
	НастройкиСервисногоАккаунта.Вставить("ИдентификаторКлюча", "");
	НастройкиСервисногоАккаунта.Вставить("СекретныйКлюч", "");
	НастройкиСервисногоАккаунта.Вставить("Использовать", Истина);
	НастройкиСервисногоАккаунта.Вставить("Представление", "");
	
	Возврат НастройкиСервисногоАккаунта;
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли