
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыхРеквизиты = Новый Массив;
	
	Если Не ЭтоГруппа Тогда
		
		Если Не Использовать Тогда
			ох_ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НепроверяемыхРеквизиты, ПроверяемыеРеквизиты);
		КонецЕсли;

	КонецЕсли;

	ох_ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыхРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьИспользование();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьИспользование();
КонецПроцедуры

Процедура ПроверитьИспользование()
	
	Если Не ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И Использовать Тогда
		ВызватьИсключение НСтр("ru = 'Для пометки удаления необходимо снять флаг использования.'", "ru");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
