
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеБакета(Бакет) Экспорт
	
	ОписаниеБакета = НовыйОписаниеБакета();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ох_БакетыОбъектныхХранилищ.Ссылка КАК Бакет,
		|	ох_БакетыОбъектныхХранилищ.Наименование КАК ИмяБакета
		|ИЗ
		|	Справочник.ох_БакетыОбъектныхХранилищ КАК ох_БакетыОбъектныхХранилищ
		|ГДЕ
		|	ох_БакетыОбъектныхХранилищ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Бакет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ОписаниеБакета, Выборка);
	КонецЕсли;
	
	Возврат ОписаниеБакета;
	
КонецФункции

Функция НовыйОписаниеБакета() Экспорт
	
	ОписаниеБакета = Новый Структура;
	ОписаниеБакета.Вставить("Бакет",
		ох_ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ох_БакетыОбъектныхХранилищ.ПустаяСсылка"));
	ОписаниеБакета.Вставить("ИмяБакета", "");
	
	Возврат ОписаниеБакета;
	
КонецФункции

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли