
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьФайлыБакета(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайлыБакетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыборкаКаталогаДляСохранения", ЭтотОбъект, ДанныеВыбранногоФайла());
	ох_ОбщегоНазначенияКлиент.ВыбратьКаталог(Оповещение, "Выберете каталог для сохранения файла");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыДиалогаПомещенияФайлов = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалогаПомещенияФайлов.Заголовок = "Выберете файл для загрузки";
	ПараметрыДиалогаПомещенияФайлов.МножественныйВыбор = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеПомещенияФайлаНаСервер", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,, ПараметрыДиалогаПомещенияФайлов, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьФайлНаСервере(ДанныеВыбранногоФайла());
	ПоказатьОповещениеПользователя("Файл удален");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСсылку(Команда)
	СсылкаНаФайл = ПолучитьСсылкуНаСервере(ДанныеВыбранногоФайла());
	ох_ОбщегоНазначенияКлиент.СообщитьПользователю(СсылкаНаФайл.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьФайлыБакетаНаСервере()
	
	ФайлыБакета.Очистить();
	
	ПараметрыОбработки = ох_КоннекторS3.НовыйПараметрыПолученияФайловБакета();
	ПараметрыОбработки.Бакет = Бакет;
	
	Ответ = ох_КоннекторS3.ПолучитьФайлыБакета(ПараметрыРаботыОбъектногоХранилища(), ПараметрыОбработки);
	
	ПроверитьОтвет(Ответ);
	
	Для Каждого Файл Из Ответ.Файлы Цикл
		
		ДанныеФайла = ФайлыБакета.Добавить();
		
		ДанныеФайла.КлючОбъекта = Файл.Ключ;
		ДанныеФайла.ДатаИзменения = Файл.ДатаИзменения;
		ДанныеФайла.РазмерФайла = Файл.Размер;
		ДанныеФайла.Расширение = Файл.Расширение;
		
		ЧастиКлючиОбъекта = СтрРазделить(Файл.Ключ, "/");
		ДанныеФайла.ИмяФайла = ЧастиКлючиОбъекта[ЧастиКлючиОбъекта.ВГраница()];
		
		ДанныеФайла.ИндексКартинки = ох_ОбщегоНазначенияКлиентСервер.ИндексПиктограммыФайла(ДанныеФайла.Расширение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыборкаКаталогаДляСохранения(ПутьККаталогу, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ПутьККаталогу) Тогда
		Возврат;
	КонецЕсли;
	
	КлючОбъекта = ДополнительныеПараметры.КлючОбъекта;
	Расширение  = ДополнительныеПараметры.Расширение;
	
	ДанныеФайла = ФайлИзХранилища(КлючОбъекта, Расширение);
	
	Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные")
		И ЗначениеЗаполнено(ДанныеФайла) Тогда
		
		ПолныйПуть = ох_ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ПутьККаталогу, КлючОбъекта);
		ДанныеФайла.Записать(ПолныйПуть);
		
		ПоказатьОповещениеПользователя("Файл сохранен");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ФайлИзХранилища(Знач КлючОбъекта, Знач Расширение)
	
	ПараметрыОбработки = ох_КоннекторS3.НовыйПараметрыПолученияФайла();
	ПараметрыОбработки.Бакет       = Бакет;
	ПараметрыОбработки.КлючОбъекта = КлючОбъекта;
	
	Если Не СтрНачинаетсяС(Расширение, ".") Тогда
		РасширениеСТочкой = "." + Расширение;
	Иначе
		РасширениеСТочкой = Расширение;
	КонецЕсли;
	ПараметрыОбработки.Расширение = РасширениеСТочкой;
	
	Ответ = ох_КоннекторS3.ПолучитьФайл(ПараметрыРаботыОбъектногоХранилища(), ПараметрыОбработки);
	
	ПроверитьОтвет(Ответ);
	
	Возврат Ответ.Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеПомещенияФайлаНаСервер(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла <> Неопределено
		И Не ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		ЗагрузитьФайлНаСервере(ОписаниеПомещенногоФайла.Адрес, ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя);
		ПоказатьОповещениеПользователя("Файл загружен");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере(Знач Адрес, Знач КлючОбъекта)
	
	ПараметрыОбработки = ох_КоннекторS3.НовыйПараметрыЗагрузкиФайла();
	ПараметрыОбработки.Бакет       = Бакет;
	ПараметрыОбработки.КлючОбъекта = КлючОбъекта;
	ПараметрыОбработки.ДанныеФайла = ПолучитьИзВременногоХранилища(Адрес);
	ПараметрыОбработки.ОбрабатыватьКлючОбъектаСКаталогами = Ложь;
	
	Ответ = ох_КоннекторS3.ЗагрузитьФайл(ПараметрыРаботыОбъектногоХранилища(), ПараметрыОбработки);
	
	ПроверитьОтвет(Ответ);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлНаСервере(Знач ДанныеФайла)
	
	ПараметрыОбработки = ох_КоннекторS3.НовыйПараметрыУдаленияФайла();
	ПараметрыОбработки.Бакет       = Бакет;
	ПараметрыОбработки.КлючОбъекта = ДанныеФайла.КлючОбъекта;
	
	Ответ = ох_КоннекторS3.УдалитьФайл(ПараметрыРаботыОбъектногоХранилища(), ПараметрыОбработки);
	
	ПроверитьОтвет(Ответ);
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеВыбранногоФайла()
	
	ТекущиеДанные = Элементы.ФайлыБакета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ВызватьИсключение "Необходимо выбрать файл";
	КонецЕсли;
	
	ДанныеВыбранногоФайла = Новый Структура;
	ДанныеВыбранногоФайла.Вставить("КлючОбъекта", ТекущиеДанные.КлючОбъекта);
	ДанныеВыбранногоФайла.Вставить("Расширение", ТекущиеДанные.Расширение);
	ДанныеВыбранногоФайла.Вставить("ИмяФайла", ТекущиеДанные.ИмяФайлаМетаданные);
	
	Возврат ДанныеВыбранногоФайла;
	
КонецФункции

&НаСервере
Функция ПолучитьСсылкуНаСервере(Знач ДанныеФайла)
	
	ПараметрыОбработки = ох_КоннекторS3.НовыйПараметрыПолученияСсылки();
	ПараметрыОбработки.Бакет            = Бакет;
	ПараметрыОбработки.КлючОбъекта      = ДанныеФайла.КлючОбъекта;
	ПараметрыОбработки.ВремяЖизниСсылки = 86400;
	ПараметрыОбработки.ИмяФайла         = ДанныеФайла.ИмяФайла;
	ПараметрыОбработки.Расширение       = ДанныеФайла.Расширение;
	
	Возврат ох_КоннекторS3.ПолучитьСсылку(ПараметрыРаботыОбъектногоХранилища(), ПараметрыОбработки);
	
КонецФункции

&НаСервере
Функция ПараметрыРаботыОбъектногоХранилища()
	
	ПараметрыРаботыСОбъектнымХранилищем = ох_КоннекторS3.НовыйПараметрыКоннектора();
	ПараметрыРаботыСОбъектнымХранилищем.НастройкиСервисногоАккаунта =
		ох_ОбъектноеХранилище.НастройкиСервисногоАккаунта(СервисныйАккаунт);
	
	Возврат ПараметрыРаботыСОбъектнымХранилищем;

КонецФункции

&НаСервере
Процедура ПроверитьОтвет(Ответ)
	Если Ответ.Ошибка Тогда
		ВызватьИсключение Ответ.Сообщение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
